[
    {
        "id": "1967277589258817631",
        "tweetText": "The actual bots are Pakistani. The Chinese and Russians don't care this much about America. They outsource to Pakistanis and Bangladeshis who America supports foolishly thinking using them they can control India forgetting that for 1000 years they tried to control 🇮🇳 and failed.",
        "tweetURL": "https://x.com/aravind/status/1967277589258817631",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "28",
        "quoteCount": "7",
        "retweetCount": "283",
        "likeCount": "2147",
        "views": "34894",
        "bookmarkCount": "62",
        "createdAt": "2025-09-14 22:51:42",
        "allMediaURL": "",
        "videoURL": ""
    },
    {
        "id": "1967259538358473144",
        "tweetText": "Hu Shih, the Chinese Indologist and renowned international diplomat said in 1940s that, \"for 2000 years India colonized China without sending a single soldier across.\"\n\nWell, this is quoted a lot without context by Indians. The context he was saying it in is more important. \n\nHis belief was that Indian dharmic culture and Indianization of China has kept it backward in modern age. And China must free itself from it.\n\nSo based on his inputs and what Chairman Mao saw as backward Chinese culture, Mao went for total annihilation in the classic communist way. He called it the \"Cultural revolution.\"\n\nThey burned down libraries, destroyed all traditional texts, killed thousands of teachers and some 35 million more later, and made the Chinese society follow modern communism as defined by the CCP.\n\nFor Deng Xiaoping to do his big developmental reforms and create a large working class in China where anyone will do any job in desperation, Mao's cultural revolution paved the way. \n\nThis led to rapid development of China on a western model. But is this the right way to go about it? Destroying your own culture and killing millions?\n\nNo.\n\nIndia's culture and civilization is being revived right now as we speak to adapt to modern values. It is being transformed slowly but surely. \n\nThis kind of transformation will yeild long term highly beneficial results. \n\nUnlike China, India was oppressed and colonized for a much longer time. But Indians, inspite of all adversities, never gave up their culture to adopt enmasse anything else. \n\nEven Islam which forced itself on Indians worse than what Mao could have done, and for many times longer in length still is in minority after one thousand years, even in 1947 pre-partition.\n\nI am so optimistic about the culture of India that in decades to come it will be the flagbearer for Indian advancement in a very chaotic world which China won't be able to handle. And breakdown unless they quickly adopt back certain Indian cultural values - which the CCP is trying to.\n\nSo a few decades of rapid development and showmanship means nothing for civilizational countries like India and Indians. Young people, like you see in this video, are only carried away by short term illusions. \n\nIn the long term, if we preserve our culture, its diversity, its plurality, and work in unision towards national development, we will come out as one of the top countries and cultures that have stood the test of time to be continually on top of the world directing its sustainable development. \n\nAs we have always been.",
        "tweetURL": "https://x.com/aravind/status/1967259538358473144",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "96",
        "quoteCount": "15",
        "retweetCount": "460",
        "likeCount": "2754",
        "views": "118102",
        "bookmarkCount": "779",
        "createdAt": "2025-09-14 21:39:58",
        "allMediaURL": "",
        "videoURL": ""
    },
    {
        "id": "1967237340117811428",
        "tweetText": "This is a good science backed research paper to read for those constantly complaining about India. You will have cognitive decline in your old age! Beware. \n\nAt least think of something positive when you have something to complain about, to even it out. \n\nThere are so many positives about India, and they are happening everyday to be ppreciated, even if you don't want to acknowledge it publicly for political reasons.",
        "tweetURL": "https://x.com/aravind/status/1967237340117811428",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "58",
        "quoteCount": "11",
        "retweetCount": "361",
        "likeCount": "2589",
        "views": "99305",
        "bookmarkCount": "629",
        "createdAt": "2025-09-14 20:11:46",
        "allMediaURL": "",
        "videoURL": ""
    },
    {
        "id": "1967091069893701688",
        "tweetText": "Not at all true. If you live in Thailand and Vietnam, you will have 2x worse air many times of the year and pay 2x more than India all the time, from rentals to food to conveyance. Even Laos is costlier than India to live. \n\nSri Lanka probably is the only place that can be said to offer better bang for the buck than India. The cost of living in Indian metros is some of the cheapest in the world for the standard of living we get. \n\nOf course, that is not an excuse to live with filth & uncleared rubble all over, and bad infra. But I am very optimistic that India will overcome this bad infra and cleanliness problem in the next decade, as it becomes a over 7000$ per capita country.",
        "tweetURL": "https://x.com/aravind/status/1967091069893701688",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "396",
        "quoteCount": "49",
        "retweetCount": "1018",
        "likeCount": "8293",
        "views": "471072",
        "bookmarkCount": "562",
        "createdAt": "2025-09-14 10:30:32",
        "allMediaURL": "https://pbs.twimg.com/media/G0yC5vKW0AAaFAy.jpg",
        "videoURL": ""
    },
    {
        "id": "1967070355685785849",
        "tweetText": "Nepal done. Keir Starmer next? I can't say exacyly the time but I am sure he will be made to resign soon. All the extreme left and communist govts are being taken out one by one by the new USDS. Taking down VZ's Maduro will be the ultimate test for the US. But I think they will. https://t.co/iM59f1zon6",
        "tweetURL": "https://x.com/aravind/status/1967070355685785849",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "303",
        "quoteCount": "50",
        "retweetCount": "1030",
        "likeCount": "6613",
        "views": "359962",
        "bookmarkCount": "419",
        "createdAt": "2025-09-14 09:08:13",
        "allMediaURL": "https://pbs.twimg.com/media/G0xwD5SaAAAwrnH.jpg",
        "videoURL": ""
    },
    {
        "id": "1966441105899278818",
        "tweetText": "Yesterday's gruesome beheading of Indian American motel owner is so sick and stomach churning to see.\n\nBut not at all that shocking, given we all knew what was coming and is only going to increase - the hate crimes against Indian ethnic people in the US.\n\nSuch violence is only going to increase because influential Indian Americans sit quietly not speaking out when one of their people is attacked like say Jews, Muslims, Blacks, and east Asians do.\n\nAll the SV Tech Bros and Indian American millionaires are quiet on this murder of a fellow entrepreneur, but are speaking out against Charlie Kirk's gruesome shooting as that's the mainstream America's topic.\n\nMr. Chandra was killed just because he asked someone to translate what the murderer was saying about using a washing machine instead of directly listening to him it seems. \n\nMy heart goes out to Chandra ji's family who witnessed it. Can't imagine what they are going through right now.",
        "tweetURL": "https://x.com/aravind/status/1966441105899278818",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "356",
        "quoteCount": "68",
        "retweetCount": "2508",
        "likeCount": "9406",
        "views": "795087",
        "bookmarkCount": "455",
        "createdAt": "2025-09-12 15:27:49",
        "allMediaURL": "",
        "videoURL": ""
    },
    {
        "id": "1966179318763266194",
        "tweetText": "Those talking of a civil war in the US after Charlie's murder are naive. It will only be used for two things. A distraction from Epstein files and gun control regulations on Americans using Trump himself. Watch how Trump soon talks about gun violence and need to regulate arms.",
        "tweetURL": "https://x.com/aravind/status/1966179318763266194",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "128",
        "quoteCount": "13",
        "retweetCount": "600",
        "likeCount": "5198",
        "views": "152895",
        "bookmarkCount": "212",
        "createdAt": "2025-09-11 22:07:34",
        "allMediaURL": "",
        "videoURL": ""
    },
    {
        "id": "1965812881452401034",
        "tweetText": "The US is soon going to put Europe into a war with Russia it doesn't need to fight. By March of next year, there's great chance of a EU-Russia conflict without US involvement as part of NATO.\n\nThey tried using Ukraine as a proxy to pull Russia into a war and weaken it. Russia did get very occupied in the war but doesn't seem weakened. \n\nThey tried stopping the war and bringing Russia into western fold to focus against China. Russia is not taking any deals forced on it with arrogance.\n\nSo now they want to make all of Europe their proxy to fight Russia. They even have a time limit: March 2026. \n\nThey get three birds in one stone of this conflict:\n\n1) Russia severely contained fighting big European powers directly. \n2) Europe totally wasted and a dependent vassal of the US. \n3) The economic mess this war creates weakening China badly, creating perfect conditions for a revolution to overthrow the CCP. \n\nNow tell me, is my analysis far fetched conspiracy or a prediction that will come true?",
        "tweetURL": "https://x.com/aravind/status/1965812881452401034",
        "type": "tweet",
        "tweetAuthor": "Aravind",
        "handle": "@aravind",
        "replyCount": "744",
        "quoteCount": "123",
        "retweetCount": "1397",
        "likeCount": "9787",
        "views": "517253",
        "bookmarkCount": "1319",
        "createdAt": "2025-09-10 21:51:28",
        "allMediaURL": "",
        "videoURL": ""
    }
]